Revit 2027 API
BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletFailure Property
 Fillet cannot be created between rail segment since the radius is lower than the profile size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailProfileLowerThanFilletFailure { get; }
Public Shared ReadOnly Property RailProfileLowerThanFilletFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailProfileLowerThanFilletFailure {
	FailureDefinitionId^ get ();
}
static member RailProfileLowerThanFilletFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace